package com.javarush.test.level03.lesson04.task01;

/* Дата рождения
Вывести на экран дату своего рождения в виде: MAY 1 2012
*/

import java.util.Date;

public class Solution
{
    public static void main(String[] args)
    {
        String date = "MAY 1 2012";//напишите тут ваш код
        System.out.printf(date);
    }
}